{
  "Title": "Automate workflow based on Clickwrap agreement",
  "SubTitle": "<p>Demonstrates how to use the DocuSign Connect webhook service to automate business processes based on an example purchase license clickwrap. Once the user takes action on the clickwrap, the app will wait for a Connect notification before sending an example purchase confirmation to the user’s provided email.</p> Please provide your name and email address to get started.</p>",
  "SubmitButton": "Submit",
  "AddRecipientButton": "Add recipient",
  "Recipient": {
    "FullName": "Full name",
    "Email": "Email"
  },
  "ApiDecription": {
    "SeeMore": "Behind The Scenes",
    "CodeFlow": "<h3>This sample features:</h3><ul><li>Create and activate a clickwrap</li><li>Embed a clickwrap on your site</li><li>DocuSign Connect webhook service</li><li>Remote signing</li></ul><h3>Code flow:</h3><p>View source file <a target='_blank' rel='noopener noreferrer' href='https://github.com/docusign/sample-app-myconnectwebhook-ruby/blob/main/app/services/clickwraps/clickwrap_service.rb'>clickwrap_service.rb</a> on GitHub.</p><h5>Step 1</h5><p>Once recipient information is submitted by the user, the Click api is used to create a new clickwrap if it doesn’t already exist in the account. To create a clickwrap, we must provide a document for the user to read and agree to, a name for the clickwrap, and we must define <code>display_settings</code> which control what the UI experience will look like. The clickwrap is created using <a target='_blank' rel='noopener noreferrer' href='https://developers.docusign.com/docs/click-api/reference/accounts/clickwraps/createclickwrap/'>ClickWraps:createClickwrap</a>. Then we must activate the clickwrap before use with <a target='_blank' rel='noopener noreferrer' href='https://developers.docusign.com/docs/click-api/reference/accounts/clickwraps/updateclickwrapversion/'>ClickWraps:updateClickwrapVersion</a> by updating the clickwrap version 1 and setting the status to <code>active</code></p>.<h5>Step 2</h5><p>Using the id of the clickwrap created in the previous step, we display the clickwrap using a JavaScript API call to the <code>docuSignClick.Clickwrap.render()</code> method. Required arguments include <code>clickwrap_environment</code> which is ‘https://demo.docusign.net’ for the development environment, <code>clickwrap_account_id</code> which is the account id for the preconfigured DocuSign demo account, <code>clickwrap_id</code> which we obtain in the previous step, and <code>client_user_id</code> which is created in the app session. To make this client-side API call the code needs to include https://demo.docusign.net/clickapi/sdk/latest/docusign-click.js in the page as a script element.</p><h5>Step 3</h5><p>Once the user accepts or declines the clickwrap, we wait for a DocuSign Connect notification to tell us what action was taken. If we receive a click-agreed notification, we can start the next step of the example workflow, otherwise the workflow ends at this step. The screenshot below shows the events we subscribe to in our custom Connect configuration in the preconfigured account.</p> <p><img width='600px' src='/images/click_config.png' alt='click connect configuration' /></p>'<h5>Step 4</h5><p>View source code <a target='_blank' rel='noopener noreferrer' href='https://github.com/docusign/sample-app-myconnectwebhook-ruby/blob/main/app/services/e_sign/send_envelope_service.rb'>send_envelope_service.rb</a> on GitHub.</p> <p>After receiving the click-agreed notification, we use the DocuSign eSignature API to create an envelope with <a target='_blank' rel='noopener noreferrer' href='https://developers.docusign.com/docs/esign-rest-api/reference/envelopes/envelopes/create/'>Envelopes:create</a>. In the envelope definition we include a recipient with the information submitted by the user, a sample purchase confirmation document, and tabs. We set the envelope definition status to <code>sent</code> so that the envelope is sent immediately when we make our api call.</p>"
  },
  "Error": {
    "FullNameIsRequired": "Full name is required",
    "EmailIsRequired": "Email is required",
    "EmailFormatIsWrong": "Email format is wrong"
  },
  "ConfirmationComplete": {
    "Title": "Clickwrap complete!",
    "SubTitle": "<p>You have completed the agreement.</p><p>If you have accepted the example purchase license agreement, check your email to see a sample order confirmation.<p>"
  }
}
